Tekla Open API Reference for Tekla Structures 2025
ViewVisibilitySettings.FittingsVisibleInComponents Property
 Gets or sets the fitting visibility inside components.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool FittingsVisibleInComponents { get; set; }
Public Property FittingsVisibleInComponents As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewVisibilitySettings Class
Tekla.Structures.Model.UI Namespace